---
kind: method
id: M:Autodesk.Revit.DB.RenderingQualitySettings.IsCustomQuality
source: html/91124250-e84e-91a6-2803-8c69df0ec688.htm
---
# Autodesk.Revit.DB.RenderingQualitySettings.IsCustomQuality Method

Checks if the current rendering quality is custom or not.

## Syntax (C#)
```csharp
public bool IsCustomQuality()
```

## Returns
True if the current rendering quality is custom, false otherwise.